namespace NaviriaAPI.Constants
{
    public class LevelCongratMessages
    {
        public static readonly Dictionary<int, string> Messages = new()
        {
            { 5, "🏆 Вітаємо! Ви досягли 5 рівня! Продовжуйте вдосконалюватися!" },
            { 10, "🥇 Неймовірно! Ви вже на 10 рівні! Ви справжній герой!" },
            { 20, "🚀 Фантастика! Ви підкорили 20 рівень! Ваш прогрес вражає!" },
            { 30, "🌟 Ваша енергія надихає! Ви вже на 30 рівні!" },
            { 40, "🔥 Ви легенда! 40 рівень — справжній подвиг!" },
            { 50, "👑 Ви досягли вершини — 50 рівень! Це епічно!" }
        };
    }
}
